content/posts/Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009.md
+++
title = "Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:45-04:00
slug = "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009"
draft = false
+++

## [computer science]({{< relref "computer_science" >}}), [physics]({{< relref "physics" >}}), [algorithms]({{< relref "algorithms" >}}), [information geometry]({{< relref "information_geometry" >}}) {#computer-science--computer-science-dot-md--physics--physics-dot-md--algorithms--algorithms-dot-md--information-geometry--information-geometry-dot-md}


## "At the core of the background necessary to understand the [free energy principle]({{< relref "free_energy_principle" >}}) is the relationship between free energy as it is used in [statistical physics]({{< relref "statistical_physics" >}}) versus its use in [probabilistic inference]({{< relref "probabilistic_inference" >}}) which is encapsulated in the notion of [variational inference]({{< relref "variational_inference" >}}). The best explanation I know of this relationship is in the formulation of Gibbs free energy via a variational principle in [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}})." {#at-the-core-of-the-background-necessary-to-understand-the-free-energy-principle--free-energy-principle-dot-md--is-the-relationship-between-free-energy-as-it-is-used-in-statistical-physics--statistical-physics-dot-md--versus-its-use-in-probabilistic-inference--probabilistic-inference-dot-md--which-is-encapsulated-in-the-notion-of-variational-inference--variational-inference-dot-md--dot-the-best-explanation-i-know-of-this-relationship-is-in-the-formulation-of-gibbs-free-energy-via-a-variational-principle-in-information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009--information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009-dot-md--dot}


## I. Background {#i-dot-background}


### 1. Introduction to information theory {#1-dot-introduction-to-information-theory}


### 2. Statistical physics and probability theory {#2-dot-statistical-physics-and-probability-theory}


### 3. Introduction to combinatorial optimization {#3-dot-introduction-to-combinatorial-optimization}


### 4. A probabilistic toolbox {#4-dot-a-probabilistic-toolbox}

<!--list-separator-->

-  4.1 Many random variables: a qualitative preview

<!--list-separator-->

-  4.2 Large deviations for independent variables

<!--list-separator-->

-  4.3 Correlated variables

<!--list-separator-->

-  4.4 The Gibbs free energy

<!--list-separator-->

-  4.5 The Monte Carlo method

<!--list-separator-->

-  4.6 Simulated annealing

<!--list-separator-->

-  4.7 Appendix: A physicists's approach to Sanov's theorem


## II. Independence {#ii-dot-independence}


## III. Models on graphs {#iii-dot-models-on-graphs}


## IV. Short-range correlations {#iv-dot-short-range-correlations}


## V. Long-range correlations {#v-dot-long-range-correlations}
